// TODO: Іноді ми заохочуємо тебе продовжувати експериментувати з вправою
// навіть після того, як ти вже все зрозумів. Якщо все працює і ти готовий
// до наступної вправи, введи `n` в терміналі.
//
// Файл вправи буде перезавантажено, коли ти зміниш один з рядків нижче!
// Спробуй додати новий `println!` і перевір оновлений вивід в терміналі.

fn main() {
    println!(r#"       Ласкаво просимо до...              "#);
    println!(r#"                 _   _ _                  "#);
    println!(r#"  _ __ _   _ ___| |_| (_)_ __   __ _ ___  "#);
    println!(r#" | '__| | | / __| __| | | '_ \ / _` / __| "#);
    println!(r#" | |  | |_| \__ \ |_| | | | | | (_| \__ \ "#);
    println!(r#" |_|   \__,_|___/\__|_|_|_| |_|\__, |___/ "#);
    println!(r#"                               |___/      "#);
    println!();
    println!("Ця вправа компілюється успішно. Решта вправ містять помилки компілятора");
    println!("або логічні помилки. Основна концепція Rustlings полягає в тому, щоб виправити ці помилки та");
    println!("розв'язати вправи. Удачі!");
    println!();
    println!("Файл цієї вправи знаходиться в `exercises/00_intro/intro1.rs`. Поглянь на нього!");
    println!("Поточний шлях до вправи завжди показано під індикатором прогресу.");
    println!("Ти можеш клікнути на шлях, щоб відкрити файл вправи у своєму редакторі.");
}