// Інструмент Clippy - це колекція лінтерів (lints) для аналізу вашого коду,
// щоб ви могли виловлювати поширені помилки та покращувати ваш Rust код.
//
// Для цих вправ код не скомпілюється, коли є попередження Clippy.
// Перевірте пропозиції Clippy у виході, щоб розв'язати вправу.

fn main() {
    // TODO: Виправте попередження Clippy у цьому рядку.
    let pi = 3.14;
    let radius: f32 = 5.0;

    let area = pi * radius.powi(2);

    println!("Площа круга з радіусом {radius:.2} рівна {area:.5}");
}
