// `Vec<T>` є дженериком (generic) над типом `T`. У більшості випадків компілятор може
// автоматично вивести `T`, наприклад після додавання значення з конкретним типом до вектора.
// Але в цій вправі компілятору потрібна допомога через анотацію типу (type annotation).

fn main() {
    // TODO: Виправте помилку компілятора, додавши анотацію типу для вектора
    // `Vec<T>`. Оберіть `T` як якийсь цілочисловий тип, що може бути створений з
    // `u8` та `i8`.
    let mut numbers = Vec::new();

    // Не змінюйте рядки нижче.
    let n1: u8 = 42;
    numbers.push(n1.into());
    let n2: i8 = -1;
    numbers.push(n2.into());

    println!("{numbers:?}");
}
