// `Vec<T>` є дженериком (generic) над типом `T`. У більшості випадків компілятор може
// автоматично вивести `T`, наприклад після додавання значення з конкретним типом до вектора.
// Але в цій вправі компілятору потрібна допомога через анотацію типу (type annotation).

fn main() {
    // `u8` та `i8` обидва можуть бути перетворені на `i16`.
    let mut numbers: Vec<i16> = Vec::new();
    //             ^^^^^^^^^^ додано

    // Не змінюйте рядки нижче.
    let n1: u8 = 42;
    numbers.push(n1.into());
    let n2: i8 = -1;
    numbers.push(n2.into());

    println!("{numbers:?}");
}
