fn main() {
    // Тут ви можете за бажанням експериментувати.
}

#[cfg(test)]
mod tests {
    #[test]
    fn slice_out_of_array() {
        let a = [1, 2, 3, 4, 5];
        //       0  1  2  3  4  <- індекси
        //          -------
        //             |
        //             +--- зріз (slice)

        // Зверніть увагу, що верхній індекс 4 не входить до зрізу.
        let nice_slice = &a[1..4];
        assert_eq!([2, 3, 4], nice_slice);

        // Верхній індекс можна включити, використовуючи синтаксис `..=` (з знаком `=`)
        let nice_slice = &a[1..=3];
        assert_eq!([2, 3, 4], nice_slice);
    }
}
