fn main() {
    // Найпростіший спосіб виправити помилку компілятора (compiler error) — це ініціалізувати
    // змінну `x`. Встановивши її значення як ціле число, Rust виводить її тип (infers its type)
    // як `i32`, що є типом за замовчуванням для цілих чисел.
    let x = 42;

    // Але ми можемо примусово встановити тип, відмінний від типу за замовчуванням (`i32`), 
    // наприклад на `u8`, додавши анотацію типу (type annotation):
    // let x: u8 = 42;

    if x == 10 {
        println!("x дорівнює десяти!");
    } else {
        println!("x не дорівнює десяти!");
    }
}
