fn main() {
    let number = "В-І-С-І-М";
    println!("Число по літерам: {number}");

    // Використай затінення/перекриття змінних (variable shadowing)
    // Затінення дозволяє оголосити нову змінну з тим самим ім'ям, що й попередня.
    // Нова змінна "затіняє" попередню, і тепер ім'я посилається на нове значення.
    // Затінення також може змінювати тип змінної.
    // https://doc.rust-lang.org/book/ch03-01-variables-and-mutability.html#shadowing
    let number = 8;
    println!("Число плюс два дорівнює: {}", number + 2);
}
