// В цьому магазині діє акція: якщо ціна парна, ви отримуєте знижку 10
// Растбаксів, а якщо непарна — знижка лише 3 Растбакси.
// Поки що не звертайте увагу на реалізацію функцій, нас цікавлять лише
// їхні сигнатури.

fn is_even(num: i64) -> bool {
    num % 2 == 0
}

// TODO: Виправ сигнатуру функції
fn sale_price(price: i64) -> {
    if is_even(price) {
        price - 10
    } else {
        price - 3
    }
}

fn main() {
    let original_price = 51;
    println!("Ваша акційна ціна {}", sale_price(original_price));
}
