// Тести важливі, щоб переконатись, що ваш код робить те, що, на вашу думку,
// він повинен робити.

fn is_even(n: i64) -> bool {
    n % 2 == 0
}

fn main() {
    // Тут ви можете за бажанням поекспериментувати.
}

#[cfg(test)]
mod tests {
    // TODO: Імпортуйте `is_even`. Ви можете використати шаблон
    // для імпорту всього з зовнішнього модуля.

    #[test]
    fn you_can_assert() {
        // TODO: Протестуйте функцію `is_even` з некоторими значеннями.
        assert!();
        assert!();
    }
}
