// Інструмент Clippy - це колекція лінтерів (lints) для аналізу вашого коду,
// щоб ви могли виловлювати поширені помилки та покращувати ваш Rust код.
//
// Для цих вправ код не скомпілюється, коли є попередження Clippy.
// Перевірте пропозиції Clippy у виході, щоб розв'язати вправу.

use std::f32::consts::PI;

fn main() {
    // Використайте більш точну константу `PI`.
    let pi = PI;
    let radius: f32 = 5.0;

    let area = pi * radius.powi(2);

    println!("Площа круга з радіусом {radius:.2} рівна {area:.5}");
}
