// Тести важливі, щоб переконатись, що ваш код робить те, що, на вашу думку,
// він повинен робити.

fn is_even(n: i64) -> bool {
    n % 2 == 0
}

fn main() {
    // Тут ви можете за бажанням поекспериментувати.
}

#[cfg(test)]
mod tests {
    // При написанні модульних тестів звичайно імпортувати все з зовнішнього
    // модуля (`super`), використовуючи шаблон.
    use super::*;

    #[test]
    fn you_can_assert() {
        assert!(is_even(0));
        assert!(!is_even(-1));
        //      ^ Ви можете стверджувати `false`, використовуючи оператор заперечення `!`.
    }
}
